<template>
    <div>
        <div style="margin-top:70px;">
            <a href="https://cloudiq.msaez.io/#/" target="_blank" class="card">가이드 영상 시청 및 사이트 이동</a>
            <h2 style="margin-top:5px;">클라우드 네이티브 전환 가이드</h2>
        </div>
        <mark-down class="content">
Cloud IQ는 클라우드 네이티브 전환과 관련한 가이드라인을 제공하기 위해 만들어졌습니다.
        </mark-down>
        <mark-down class="content">
### **메뉴 구성**
        </mark-down>
        <br />
        <g-image src="~/img/02_Planning/04_클라우드네이티브전환_계획/image1.png"></g-image>
        <br />
        <mark-down class="content">
### **그룹**
아무 Step으로 들어가게 되면 우측 상단에 그룹을 눌러 편집할 수 있습니다.
- 그룹을 눌러 펼치면 하위 프로필을 생성할 수 있으며 총 2댑스로만 가능합니다.
- 선택된 그룹 또는 프로필에 맞춰 차트는 자동으로 업데이트 됩니다.
        </mark-down>
        <br />
        <g-image src="~/img/02_Planning/04_클라우드네이티브전환_계획/image7.png"></g-image>
        <br />
        <table>
            <tr>
                <td style="text-align: center;"><v-icon>mdi-pencil</v-icon></td>
                <td>그룹 또는 프로필 이름을 수정할 수 있습니다.<br>저장은 엔터키로 가능합니다.</td>
            </tr>
            <tr>
                <td style="text-align: center;"><v-icon color="red">mdi-delete</v-icon></td>
                <td>삭제 버튼입니다. 누르게 되면 삭제하겠냐는 알림창이 나옵니다.<br>체크를 하고 삭제를 한번 더 누르게 되면 삭제됩니다.</td>
            </tr>
            <tr>
                <td style="text-align: center;">그룹 추가</td>
                <td>버튼을 누르게 되면 입력창이 나옵니다. <br>저장은 엔터키로 가능합니다.</td>
            </tr>
            <tr>
                <td style="text-align: center;">프로필 추가</td>
                <td>버튼을 누르게 되면 입력창이 나옵니다. <br>저장은 엔터키로 가능합니다.</td>
            </tr>
        </table>
        <mark-down class="content">
### **Step.1 목표 수준**
목표 수준은 클라우드 네이티브 전환을 발주하는 발주 기관의 담당자 중심으로 수준을 설정하고
현 우리 부처의 시스템이 지향해야 하는 목표 수준에 대해서 총 5가지 관점에 대해서 질의 문항을 왼편에 표시합니다.
왼편 질의 문항에 체크하게 되면 우측 차트에 목표 수준이 어느 정도인지 파란색으로 표시됩니다.

- 기능 확장 및 신속한 시장대응 관점
- 안정적 서비스 운영 관점
- 서비스 중요도 관점
- 조직 및 개발품질 향상 관점
- 개발 생산성 향상 관점
        </mark-down>
        <br />
        <g-image src="~/img/02_Planning/04_클라우드네이티브전환_계획/image2.png"></g-image>
        <br />
        <mark-down class="content">
### **Step.2 현 수준 평가**
현수준평가는 각 관점별 level 수준을 측정하는 메뉴 입니다.
현 수준은 해당 발주 기관의 담당자 또는 수행업체가 진행하는 메뉴이고 총 4개의 레벨이 표시되고 체크 여부에 따라 현 수준을 체크 할 수 있습니다.
왼편 질의 문항에 체크하게 되면 우측 차트에 현 수준이 어느 정도인지 노란색으로 표시됩니다.

- 애플리케이션 관점
- 데이터베이스 관점
- 인프라스트럭처 관점
- 개발 관점
- 보안 관점
- 확장성 관점
- 가시성 관점
        </mark-down>
        <br />
        <g-image src="~/img/02_Planning/04_클라우드네이티브전환_계획/image3.png"></g-image>
        <br />
        <mark-down class="content">
### **Step.3 전환 가이드**
전환가이드는 클라우드 네이티브 전환을 위한 가이드라인을 제공하는 곳입니다. 목표 수준과 현 수준을 비교하여 필요한 전환 단계를 안내합니다.
이 가이드는 각 항목을 기준으로 현 수준과 목표 수준을 비교하여, 필요한 전환 전략과 단계를 명확하게 제시합니다. 이를 통해 클라우드 네이티브 환경으로의 원활한 전환을 돕습니다.
        </mark-down>
        <mark-down class="content">
#### **검토 결과**
검토 결과 표는 클라우드 네이티브 전환을 위한 현재 수준과 목표 수준을 비교하여 각 영역에 대한 상태를 시각적으로 보여줍니다.
각 수준은 애플리케이션, 데이터베이스, 인프라스트럭처, 개발, 보안, 확장성, 가시성 등 다양한 관점에서 평가됩니다.

**표 구성**
| 항목                   | 설명                                                                 |
|------------------------|--------------------------------------------------------------------|
| **수준 (Level)**       | 각 영역은 1부터 4까지의 수준으로 평가되며, 1단계는 가장 기본적인 상태, 4단계는 가장 고도화된 상태를 나타냅니다. |
| **목표 수준 (🟦)**      | 각 영역의 목표 수준을 나타냅니다.                                        |
| **현 수준 (🟧)**        | 각 영역의 현재 수준을 나타냅니다.                                        |
| **달성 수준 (🟩)**      | 목표 수준과 현재 수준이 일치하는 경우를 나타냅니다.                          |

        </mark-down>
        <br />
        <g-image src="~/img/02_Planning/04_클라우드네이티브전환_계획/image4.png"></g-image>
        <br />
        <mark-down class="content">
#### **참조 아키텍처**
참조 아키텍처 메뉴는 클라우드 네이티브 전환을 위한 다양한 아키텍처 패턴을 제시하여, 조직이 현재 시스템을 최적화하고 개선할 수 있도록 도와줍니다.
이 메뉴는 목표 수준과 현 수준을 비교하여, 필요한 전환 단계를 명확히 이해하고 이를 기반으로 구체적인 전략을 수립할 수 있게 합니다.
        </mark-down>
        <br />
        <g-image src="~/img/02_Planning/04_클라우드네이티브전환_계획/image5.png"></g-image>
        <br />
        <mark-down class="content">
#### **목표 성숙도 모델**
이미지의 목표 성숙도 모델은 다음 네 가지 단계로 구성됩니다:
| 단계             | 설명                                                 |
|------------------|------------------------------------------------------|
| 기존 시스템 유지 | 현재 시스템을 클라우드로 옮기지 않고 유지하는 단계  |
| 클라우드 준비 단계 | 클라우드로의 전환을 준비하는 단계                 |
| 클라우드 친화 단계 | 클라우드 환경에 최적화된 단계                     |
| 클라우드 네이티브 | 완전히 클라우드 네이티브 아키텍처를 구현한 단계    |


#### **전환 방법**
이미지의 목표 성숙도 모델은 다음 네 가지 단계로 구성됩니다.
전환 방법 그래프는 Value Add와 Investment의 두 축으로 구성되고 조직의 필요와 목표에 따라 네 가지로 분류됩니다.

**Retain (유지):**
- 클라우드로 이동하지 않고 현재 시스템을 그대로 유지하는 전략.
- 투자 비용이 낮으며, 현재 시스템을 안정적으로 운영할 수 있습니다.
- 이미지 상에서 가장 좌측에 위치한 Retain 단계입니다.

**ReHost (재호스팅):**
- 애플리케이션을 클라우드 인프라로 그대로 옮기는 전략.
- 기존 애플리케이션을 변경하지 않고 인프라만 전환하는 방식.
- 투자 비용이 적고, 빠르게 클라우드로 이동할 수 있습니다.

**RePlatform (재플랫폼):**
- 일부 최적화를 통해 클라우드 환경에서 더 효율적으로 운영할 수 있도록 하는 전략.
- 애플리케이션의 기본 구조를 유지하면서도 클라우드의 이점을 활용합니다.
- 이미지 상에서 중간 단계에 위치한 Replatform입니다.

**ReArchitect (재설계):**
- 애플리케이션을 클라우드 네이티브로 완전히 재설계하는 전략.
- 높은 투자 비용과 시간이 필요하지만, 클라우드 환경에서 최대의 이점을 얻을 수 있습니다.
- 이미지 상에서 가장 우측에 위치한 Rearchitect 단계입니다.


이 아키텍처는 현재 시스템을 유지하면서도 일부 마이크로서비스 아키텍처의 장점을 도입하여 운영 효율성을 높일 수 있는 방법을 제시합니다.
이를 통해 현재 시스템을 안정적으로 유지하면서 점진적으로 클라우드 네이티브 환경으로 전환할 수 있습니다.
        </mark-down>
        <br />
        <mark-down class="content">
#### **영역별 탭**
각각의 총 7개의 관점별 level에서 각각의 수준별로 클라우드 네이티브로의 전환이 될 때 영역별로 지켜야 하는 원칙과 절차에 대한 상세 가이드라인이 제공됩니다.

        </mark-down>
        <br />
        <g-image src="~/img/02_Planning/04_클라우드네이티브전환_계획/image6.png"></g-image>
        <br />
    </div>
</template>


<script>
        // @group 01_02_08
    export default {
        name:'CloudIq',
        data() {
            return {}
        },
        props: {
            "클라우드 네이티브 전환 가이드": {
                type: String
            },
        },

    }
</script>

<style scoped>
.card {
    display: inline-block;
    border-radius: 5px;
    box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1);
    background-color: rgba(90, 103, 216);
    transition: box-shadow 0.3s ease;
    text-align: center;
    padding:8px;
    text-decoration: none;
    font-size: 16px;
    font-weight: 700;
    color: #fff !important;
}

.card:hover {
    opacity: 0.9;
}
</style>